/***************************************************************/
/*             HW#4 : 생성자와 소멸자, 분할컴파일                    */
/*  작성자 : 배용호                    날짜 : 2023년 4월 16일        */
/*                                                                 */
/* 문제 정의 : 소스를 헤더 파일과 cpp 파일로 분리하여 재작성하라.      */
/*                - - - - - - -                                   */
/***************************************************************/
class Adder { // 덧셈 모듈 클래스
	int op1, op2; //멤버변수 op1, op2 선언
public:
	Adder(int a, int b); // 생성자 Adder 선언(인자 a,b)
	int process(); //멤버함수 process 선언
};