/***************************************************************/
/*             HW#4 : 생성자와 소멸자, 분할컴파일                    */
/*  작성자 : 배용호                    날짜 : 2023년 4월 16일        */
/*                                                                 */
/* 문제 정의 : 소스를 헤더 파일과 cpp 파일로 분리하여 재작성하라.      */
/*                - - - - - - -                                   */
/***************************************************************/
class Calculator { // 계산기 클래스
public:
	void run(); //멤버함수 run 선언
};